{
  "posts": [
    {
      "userId": 1,
      "id": 4,
      "title": "Post excerpts",
      "body": "You can access a snippet of a posts’s content by using excerpt variable on a post. By default this is the first paragraph of content in the post, however it can be customized by setting a excerpt_separator variable in front matter or _config.yml."
    },
    {
      "userId": 1,
      "id": 5,
      "title": "Front Matter",
      "body": "The simplest way to set a permalink is using front matter. You set the permalink variable in front matter to the output path you’d like."
    },
    {
      "userId": 1,
      "id": 6,
      "title": "The Data Folder",
      "body": "The _data folder is where you can store additional data for Jekyll to use when generating your site. These files must be YAML, JSON, or CSV files (using either the .yml, .yaml, .json or .csv extension), and they will be accessible via site.data."
    },
    {
      "userId": 1,
      "id": 7,
      "title": "List of members",
      "body": "Here is a basic example of using Data Files to avoid copy-pasting large chunks of code in your Jekyll templates."
    },
    {
      "userId": 1,
      "id": 8,
      "title": "Accessing a specific author",
      "body": "For information on how to build robust navigation for your site (especially if you have a documentation website or another type of Jekyll site with a lot of pages to organize), see Navigation."
    },
    {
      "userId": 1,
      "id": 9,
      "title": "Blog Migrations",
      "body": "cIf you’re switching to Jekyll from another blogging system, Jekyll’s importers can help you with the move. To learn more about importing your site to Jekyll, visit our jekyll-import docs site."
    },
    {
      "userId": 1,
      "id": 10,
      "title": "Passing parameters to includesPermalink",
      "body": "Passing parameters to includes is especially helpful when you want to hide away complex formatting from your Markdown content."
    },
    {
      "title": "hkjkhl;kjl;",
      "body": "kljlknk",
      "id": 11
    }
  ]
}